package com.shahjahan.zakat;

import androidx.appcompat.app.AppCompatActivity;

import android.os.Bundle;
import android.speech.tts.TextToSpeech;
import android.view.View;
import android.widget.RelativeLayout;

public class zakat_foroz extends AppCompatActivity {


    RelativeLayout foroz;

    TextToSpeech tts;

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_zakat_foroz);

        foroz=findViewById(R.id.foroz);

        tts=new TextToSpeech(zakat_foroz.this, new TextToSpeech.OnInitListener() {
            @Override
            public void onInit(int i) {

            }
        });




        foroz.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View view) {
                String tag = foroz.getTag().toString();
                if (tag.equals("play")){
                    tts.speak("যাকাত ফরজ হওয়ার শর্ত কয়টি\n" +
                            "\n" +
                            "ইসলামের মুল ৫টি স্তম্ভের মধ্যে যাকাত একটি। ইসলামে নামাজ, রোজা, হজ্জ পালনের জন্য কতগুলো শর্ত মেনে চলতে হয়। যাকাত ক্ষেত্রে এর ব্যতিক্রম নয়। যাকাত ফরজ হওয়ার জন্য কতগুলো শর্ত প্রযোজ্য রয়েছে। নামাজ আদায়ের সাথে বান্দার মনস্তাত্ত্বিক বিষয় জড়িত আর যাকাত এর ক্ষেত্রে বান্দার আর্থিক সংশ্লিষ্টতা জড়িত। গরীব মানুষের জন্য যাকাত ফরজ নয়। যাকাত ফরজ ধনবান বিত্তশালী মুসলমানদের জন্য।  নিচে যাকাত ফরজ হওয়ার জন্য ১০টি শর্ত বর্ণিত হলো-\n" +
                            "\n" +
                            "১। মুসলিম হওয়া– যাকাত ফরজ হওয়ার ১ম শর্ত হলো মুসলমান হওয়া। ধনবান বিত্তশালী মুসলমানদের উপর যাকাত ফরজ করা হয়েছে। যাকাত ফরজ হওয়ার প্রধান শর্তই হলো মুসলমান হওয়া। কোন অমুসলিম ব্যক্তির উপর যাকাত ফরজ নয়।\n" +
                            "\n" +
                            "২। নিসাব পরিমাণ সম্পদের মালিক হওয়া-যাকাত ফরজ হওয়ার ২য় শর্ত হলো নিসাব পরিমাণ সম্পদের মালিক হওয়া। অর্থাৎ সাড়ে সাত তোলা সোনা বা সাড়ে বায়ান্ন তোলা রুপা অথবা এর সমপরিমাণ টাকা বা ব্যবসার মালের মালিক হলে তাকে ইসলামের বিধান অনুযায়ী যাকাত প্রদান করতে হবে। নিসাব পরিমাণ সম্পদের মালিক না হলে তার উপর যাকাত ফরজ নয়। \n" +
                            "\n" +
                            "৩। বালেগ হওয়া অর্থাৎ প্রাপ্তবয়স্ক হওয়া– যাকাত ফরজ হওয়ার জন্য আরেকটি শর্ত হলো পূর্ণবয়স্ক হওয়া। যাকাত প্রদান করতে হলে তাকে প্রাপ্তবয়স্ক ও জ্ঞান থাকতে হবে। নাবালক এর জন্য যাকাত ফরজ নয়। \n" +
                            "\n" +
                            "৪। বিবেক ও বুদ্ধি সম্পন্ন হওয়া– যাকাত প্রদান করতে হলে তাকে বিবেক ও বুদ্ধি সম্পন্ন মানুষ হতে হবে। পাগলের উপর যাকাত ফরজ নয়। পাগল যদি নিসাব পরিমাণ সম্পদের মালিক ও হয় তবুও তার উপর যাকাত ফরজ নয়।  তবে কিছু কিছু মাযহাব মতে পাগল যদি নিসাব পরিমাণ সম্পদের মালিক হয় তাহলে তার উপর যাকাত ফরজ হবে। সেই ক্ষেত্রে তার অভিভাবকগণ তা আদায় করবে। \n" +
                            "\n" +
                            "৫। স্বাধীন হওয়া– যাকাত ফরজ হওয়ার অন্যতম শর্ত হলো স্বাধীন হওয়া। কোন দাস-দাসীর উপর যাকাত ফরজ নয়।\n" +
                            "\n" +
                            "৬। সম্পদের উপর পূর্ণ মালিকানা থাকা– যাকাত ফরজ হওয়ার শর্ত হলো যে সম্পদের উপর যাকাত ফরজ হবে ওই সম্পদের উপর পূর্ণ মালিকানা থাকতে হবে অর্থাৎ ভোগ দখলের পূর্ণ অধিকার থাকতে হবে। অন্যথায় যাকাত ফরজ হবে না।\n" +
                            "\n" +
                            "৭। সম্পদ বর্ধনযোগ্য হওয়া– যাকাত দেওয়ার প্রধান উদ্দেশ্য হলো দরিদ্রকে সহযোগিতা করা এবং তার প্রতি সহানুভূতি প্রকাশ করা। কিন্তু আল্লাহ চান না যে কোন ব্যক্তি যাকাত দিতে গিয়ে দারিদ্র হয়ে যাক। কোন ব্যক্তির সম্পদ যদি বর্ধনশীল না হয় তাহলে বছরের পর বছর যাকাত প্রদানের ফলে সেই ব্যক্তির সম্পদ নিঃশেষ হয়ে যাবে। তাই কোন ব্যক্তির উপর যাকাত ফরজ হওয়ার ক্ষেত্রে তার সম্পদ বর্ধনশীল হওয়া অপরিহার্য।\n" +
                            "\n" +
                            "৮। সম্পদ মৌলিক প্রয়োজনের চেয়ে অতিরিক্ত হওয়া– যাকাতের অন্যতম শর্ত হলো যাকাতের সম্পদ মৌলিক প্রয়োজনের থেকে অতিরিক্ত হওয়া। নিত্য প্রয়োজনীয় সম্পদের উপর যাকাত ফরজ নয়। তাই যে ব্যক্তির মৌলিক প্রয়োজনের অতিরিক্ত সম্পদ রয়েছে সেই ব্যক্তির উপর যাকাত ফরজ।\n" +
                            "\n" +
                            "৯। সম্পদ ঋণ মুক্ত হওয়া– যাকাত প্রদানের ক্ষেত্রে সম্পদ ঋণ মুক্ত হতে হবে। ঋণ পরিশোধ করার পর যদি নিসাব পরিমাণ সম্পদ মজুদ থাকে তবে সেই সম্পদের যাকাত প্রদান করতে হবে। রাসূল সাল্লাল্লাহু আলাইহি ওয়াসাল্লাম ঋণের প্রতি অত্যন্ত গুরুত্ব আরোপ করে বলেছেন যদি কোন ব্যক্তি ঋণগ্রস্থ থাকে তাহলে সে প্রথমে ঋণ পরিশোধ করবে তারপর যাকাত প্রদান করবে।\n" +
                            "\n" +
                            "১০। সম্পদ পূর্ণ এক বছর মালিকানায় থাকা। কোন ব্যক্তির সম্পদ যদি হিজরি ১ বছরের কম সময় তার মালিকানায় থাকে তবে সেই ব্যক্তির ওপর যাকাত ফরজ নয়। এ শর্তটি ব্যক্তির নগদ অর্থ, সোনা-রুপা, ব্যবসায়িক মালামালসহ যাবতীয় সকল ক্ষেত্রেই প্রযোজ্য।",TextToSpeech.QUEUE_FLUSH,null,null);
                    foroz.setTag("pause");

                }else {
                    if (tts.isSpeaking()){
                        tts.stop();
                    }
                    foroz.setTag("play");

                }









            }
        });

    }


    @Override
    protected void onDestroy() {
        if (tts!=null){
            tts.stop();
            tts.shutdown();
        }
        super.onDestroy();
    }
}